{"class_name": "Sequential", "config": {"name": "sequential_15", "layers": [{"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_5", "trainable": true, "batch_input_shape": [null, 64, 5, 16, 1], "dtype": "float32", "filters": 1, "kernel_size": [86, 2, 1], "strides": [2, 2, 1], "padding": "valid", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": 0.5, "dtype": "float32"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.5, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.9920480251312256, "l2": 0.0}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.9920480251312256, "l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "Reshape", "config": {"name": "reshape_5", "trainable": true, "dtype": "float32", "target_shape": [2120, 16, 1]}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}