{"class_name": "Sequential", "config": {"name": "sequential_132", "layers": [{"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_44", "trainable": true, "batch_input_shape": [null, 64, 5, 8, 1], "dtype": "float32", "filters": 1, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": 0.5, "dtype": "float32"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.5, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 1.0, "l2": 0.0}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 1.0, "l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "Reshape", "config": {"name": "reshape_44", "trainable": true, "dtype": "float32", "target_shape": [320, 8, 1]}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}