{"class_name": "Sequential", "config": {"name": "sequential_25", "layers": [{"class_name": "Conv3D", "config": {"name": "conv3d_5", "trainable": true, "batch_input_shape": [null, 64, 111, 14, 1], "dtype": "float32", "filters": 1, "kernel_size": [2, 12, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": 0.0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 1.0, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.9161248803138733, "l2": 0.0}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.9161248803138733, "l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_15", "trainable": true, "dtype": "float32", "target_shape": [6300, 14, 1]}}], "build_input_shape": [null, 64, 111, 14, 1]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}