{"class_name": "Sequential", "config": {"name": "sequential_17", "layers": [{"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_5", "trainable": true, "batch_input_shape": [null, 2120, 16, 1], "dtype": "float32", "filters": 1, "kernel_size": [488, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": 0.5, "dtype": "float32"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.5, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.7274274826049805, "l2": 0.0}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.7274274826049805, "l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}