{"class_name": "Sequential", "config": {"name": "sequential_520", "layers": [{"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_105", "trainable": true, "batch_input_shape": [null, 882, 14, 1], "dtype": "float32", "filters": 1, "kernel_size": [1426, 1], "strides": [4, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": 0.0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 1.0, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.7906510233879089, "l2": 0.0}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.7906510233879089, "l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}], "build_input_shape": [null, 882, 14, 1]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}