{"class_name": "Sequential", "config": {"name": "sequential_316", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_105", "trainable": true, "batch_input_shape": [null, 2607, 10, 1], "dtype": "float32", "filters": 1, "kernel_size": [969, 1], "strides": [2, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": 0.5, "dtype": "float32"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.5, "dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.9095810055732727, "l2": 0.0}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.9095810055732727, "l2": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}